NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_lmac.svd
        <cluster>
          <name>CUSTCMD</name>
          <description>Unspecified</description>
          <headerStructName>MSPI_CUSTCMD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x42C</addressOffset>
          <register>
            <name>ENABLE</name>
            <description>Custom command enable</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IO2</name>
                <description>Enable custom command mode for IO2</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IO3</name>
                <description>Enable custom command mode for IO3</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VALUE</name>
            <description>Custom command value</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IO2</name>
                <description>Value to override IO2 to in custom command mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>IO3</name>
                <description>Value to override IO3 to in custom command mode</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>PINOECONTROL</name>
          <description>Override and control the output enable signal to the GPIO pads</description>
          <addressOffset>0x470</addressOffset>
          <access>read-write</access>
          <resetValue>0x33000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MIRROR</name>
              <description>Enable mirroring of output enable of pin 0 for corresponding bit</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EnableIO0</name>
                  <description>Enable mirroring on output enable for IO0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO1</name>
                  <description>Enable mirroring on output enable for IO1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO2</name>
                  <description>Enable mirroring on output enable for IO2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO3</name>
                  <description>Enable mirroring on output enable for IO3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableAll</name>
                  <description>Enable mirroring on output enable for all data lines</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Enabling mirroring on Output Enable is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEON</name>
              <description>Force pin direction to be output</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EnableIO0</name>
                  <description>Forcing on enabled output for IO0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO1</name>
                  <description>Forcing on enabled output for IO1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO2</name>
                  <description>Forcing on enabled output for IO2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO3</name>
                  <description>Forcing on enabled output for IO3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableAll</name>
                  <description>Forcing on enabled output for all data lines</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Forcing on Output Enable is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEOFF</name>
              <description>Force pin direction to be input</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EnableIO0</name>
                  <description>Forcing off enabled output for IO0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO1</name>
                  <description>Forcing off enabled output for IO1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO2</name>
                  <description>Forcing off enabled output for IO2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableIO3</name>
                  <description>Forcing off enabled output for IO3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnableAll</name>
                  <description>Forcing off enabled output for all data lines</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Forcing off Output Enable is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TURNAROUNDON</name>
              <description>Time needed for pin output driver to turn on (in core clock cycles)</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Unspecified</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TMOD</name>
          <description>Transfer Mode of the MSPI when used as peripheral This register is exclusive to the 'peripheral' configuration</description>
          <addressOffset>0x490</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TMOD</name>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXONLY</name>
                  <description>Transmit only mode; Or Write in enhanced SPI operating mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXONLY</name>
                  <description>Receive  only mode; Or Read in enhanced SPI operating mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDON</name>
          <description>End the DMA if the MSPI meets any of the defined states This task is exclusive to the 'peripheral' configuration</description>
          <addressOffset>0x494</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRANSFERLENGHT</name>
              <description>End the DMA transaction when the transferlength has been met</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CHIPSELECT</name>
              <description>End the DMA transaction when chip select goes inactive</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RXD</name>
          <description>Unspecified</description>
          <headerStructName>MSPI_RXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x4B0</addressOffset>
          <register>
            <name>AMOUNT</name>
            <description>DMA data amount</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXD</name>
          <description>Unspecified</description>
          <headerStructName>MSPI_TXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x4D0</addressOffset>
          <register>
            <name>AMOUNT</name>
            <description>DMA data amount</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>MSPI_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <cluster>
            <name>STATUS</name>
            <description>EasyVDMA status registers.</description>
            <headerStructName>MSPI_DMA_STATUS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>BYTECOUNT</name>
              <description>Number of bytes sent or received during processing of current descriptor list</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BYTECOUNT</name>
                  <description>Number of bytes sent or received during processing of current descriptor list</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ATTRIBUTE</name>
              <description>Latest job attribute being processed.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ATTRIBUTE</name>
                  <description>Latest job attribute being processed.</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ADDRESS</name>
              <description>Latest address being accessed.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <description>Latest address being accessed.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>JOBCOUNT</name>
              <description>Number of completed jobs in current descriptor list.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>JOBCOUNT</name>
                  <description>Number of completed jobs in current descriptor list.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERROR</name>
              <description>AXI bus error status.</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUSERROR</name>
                  <description>AXI bus error type</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NoError</name>
                      <description>There are no errors.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ReadError</name>
                      <description>Error related to memory when reading joblist, or error related to memory/register when reading data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ReadDecodeError</name>
                      <description>Error related to the joblist address when reading joblist, or error related to address when reading memory/register.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>WriteError</name>
                      <description>Error related to memory/register when writing data.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>WriteDecodeError</name>
                      <description>Error related to the memory/register address when writing data.</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>FIFO</name>
              <description>Data fifo status.</description>
              <addressOffset>0x014</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXFIFO</name>
                  <description>Memory-to-Peripheral direction data fifo status</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>Fifo is empty.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NotEmpty</name>
                      <description>Fifo contains data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Full</name>
                      <description>Fifo is full.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXFIFO</name>
                  <description>Peripheral-to-Memory direction data fifo status</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Empty</name>
                      <description>Fifo is empty.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NotEmpty</name>
                      <description>Fifo contains data.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Full</name>
                      <description>Fifo is full.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>ACTIVE</name>
              <description>DMA activity state.</description>
              <addressOffset>0x018</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ACTIVE</name>
                  <description>DMA activity state.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Idle</name>
                      <description>DMA is in idle state.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Active</name>
                      <description>Data is being transferred.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>CONFIG</name>
            <description>EasyVDMA configuration registers</description>
            <headerStructName>MSPI_DMA_CONFIG</headerStructName>
            <access>read-write</access>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>BUFFERFILL</name>
              <description>Data to be used when data is sent with BufferFill attribute</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUFFERFILL</name>
                  <description>Data to be used when data is sent with BufferFill attribute</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LISTPTR</name>
              <description>Start address of descriptor list</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LISTPTR</name>
                  <description>Start address of descriptor list</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LISTPARTTHRESH</name>
              <description>Number of jobs to process before generating event EVENTS_DONE.LISTPART to signal that descriptor list is partially completed.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LISTPARTTHRESH</name>
                  <description>Threshold value.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
